Revit 2026 API

# APIObjectIsReadOnly Property

---

Identifies if the object is read-only or modifiable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool IsReadOnly { get; }
```
```vb
Public Overridable ReadOnly Property IsReadOnly As Boolean
	Get
```
```cpp
public:
virtual property bool IsReadOnly {
	bool get ();
}
```
```fsharp
abstract IsReadOnly : bool with get
override IsReadOnly : bool with get
```

#### Property Value

BooleanIf true, the object may not be modified. If false, the object's contents may be modified.

#### Reference

APIObject Class

Autodesk.Revit.DB Namespace